/**
 * Fast.Admin.Enum.NationEnum 民族枚举
 */
export enum NationEnum {
  /**
   * 汉族
   */
  Han = 1,
  /**
   * 蒙古族
   */
  Mongol = 2,
  /**
   * 回族
   */
  Hui = 3,
  /**
   * 藏族
   */
  Tibetan = 4,
  /**
   * 维吾尔族
   */
  Uygur = 5,
  /**
   * 苗族
   */
  Miao = 6,
  /**
   * 彝族
   */
  Yi = 7,
  /**
   * 壮族
   */
  Zhuang = 8,
  /**
   * 布依族
   */
  Buyi = 9,
  /**
   * 朝鲜族
   */
  Korean = 10,
  /**
   * 满族
   */
  Manchu = 11,
  /**
   * 侗族
   */
  Dong = 12,
  /**
   * 瑶族
   */
  Yao = 13,
  /**
   * 白族
   */
  Bai = 14,
  /**
   * 土家族
   */
  Tujia = 15,
  /**
   * 哈尼族
   */
  Hani = 16,
  /**
   * 哈萨克族
   */
  Kazak = 17,
  /**
   * 傣族
   */
  Dai = 18,
  /**
   * 黎族
   */
  Li = 19,
  /**
   * 傈僳族
   */
  Lisu = 20,
  /**
   * 佤族
   */
  Wa = 21,
  /**
   * 畲族
   */
  She = 22,
  /**
   * 高山族
   */
  Gaoshan = 23,
  /**
   * 拉祜族
   */
  Lahu = 24,
  /**
   * 水族
   */
  Shui = 25,
  /**
   * 东乡族
   */
  Dongxiang = 26,
  /**
   * 纳西族
   */
  Naxi = 27,
  /**
   * 景颇族
   */
  Jingpo = 28,
  /**
   * 柯尔克孜族
   */
  Kirgiz = 29,
  /**
   * 土族
   */
  Tu = 30,
  /**
   * 达斡尔族
   */
  Daur = 31,
  /**
   * 仫佬族
   */
  Mulam = 32,
  /**
   * 羌族
   */
  Qiang = 33,
  /**
   * 布朗族
   */
  Blang = 34,
  /**
   * 撒拉族
   */
  Salar = 35,
  /**
   * 毛南族
   */
  Maonan = 36,
  /**
   * 仡佬族
   */
  Gelao = 37,
  /**
   * 锡伯族
   */
  Xibe = 38,
  /**
   * 阿昌族
   */
  Achang = 39,
  /**
   * 普米族
   */
  Pumi = 40,
  /**
   * 塔吉克族
   */
  Tajik = 41,
  /**
   * 怒族
   */
  Nu = 42,
  /**
   * 乌孜别克族
   */
  Uzbek = 43,
  /**
   * 俄罗斯族
   */
  Russian = 44,
  /**
   * 鄂温克族
   */
  Ewenki = 45,
  /**
   * 德昂族
   */
  Deang = 46,
  /**
   * 保安族
   */
  Bonan = 47,
  /**
   * 裕固族
   */
  Yugur = 48,
  /**
   * 京族
   */
  Gin = 49,
  /**
   * 塔塔尔族
   */
  Tatar = 50,
  /**
   * 独龙族
   */
  Derung = 51,
  /**
   * 鄂伦春族
   */
  Oroqen = 52,
  /**
   * 赫哲族
   */
  Hezhen = 53,
  /**
   * 门巴族
   */
  Monba = 54,
  /**
   * 珞巴族
   */
  Lhoba = 55,
  /**
   * 基诺族
   */
  Jino = 56,
  /**
   * 其他
   */
  Other = 99,
}
